import { Question } from "@/types/QuizType";

export const personalityQuestions: Question[] = [
  {
    title: "เสียงของการเริ่มต้น",
    question: `คุณลืมตาขึ้นมาในห้องสีขาวที่เงียบจนได้ยินเสียงหัวใจเต้นเบา ๆ

สวัสดีผู้ได้รับเชิญ คุณได้เข้าร่วมโปรเจกต์ลับ "The Silent Loud"
คุณจะได้รับ "พลังแรก" เพื่อใช้ปลุกความเงียบในโลกใบนี้

คุณจะทำอะไรต่อจากนี้ดี`,
    dimension: "EI", // This question tests Extroversion vs Introversion
    answers: [
      { 
        text: "เดินออกจากห้อง ตามหาผู้รับเชิญคนอื่นและพูดคุยด้วย", 
        dimension: "E" // Extrovert
      },
      { 
        text: "ออกเดินสำรวจเงียบ ๆ ท่ามกลางผู้คน", 
        dimension: "E" // Extrovert
      },
      { 
        text: "นั่งลงข้างในห้อง เปิดสมุดจด ทบทวนสิ่งที่เกิดขึ้น", 
        dimension: "I" // Introvert
      },
      { 
        text: "นั่งอยู่ที่เดิม หยิบหูฟังขึ้นมาใส่ หยุดโลกภายนอกให้เงียบสนิท", 
        dimension: "I" // Introvert
      }
    ]
  },
  {
    title: "การตัดสินในความเงียบ",
    question: `ประตูห้องเปิดออก คุณพบใครคนหนึ่งที่น่ารักและใส่ใจทุกคน
ไม่ว่าเขาพูดอะไร ก็ดูน่าค้นหา น่าฟัง

เริ่มมีคนมาล้อมนั่งฟังมากขึ้น
เขาเริ่มเล่าเรื่องราวบางอย่าง ไม่นานก็ข้อถกเถียงขึ้นในวงสนทนา

คุณรู้สึกอย่างไร`,
    dimension: "TF", // This question tests Thinking vs Feeling
    answers: [
      { 
        text: "ห้ามเขาคนนั้น ฉันไม่ปล่อยผ่านอะไรที่ไม่ถูกต้อง", 
        dimension: "T" // Thinking
      },
      { 
        text: "ฉันพยายามทำความเข้าใจเขา และพยายามไกล่เกลี่ยทั้งสองฝ่ายให้เข้าใจกัน", 
        dimension: "T" // Thinking
      },
      { 
        text: "ยังไม่ทำอะไร แต่สงสัยว่าเขาทำแบบนั้นเพราะอะไร ฉันใส่ใจเจตนาของเขามากกว่าการกระทำ", 
        dimension: "F" // Feeling
      },
      { 
        text: "ฉันจะช่วยเขา ส่งเสียงออกไป เขาอาจต้องการเพื่อนร่วมทางและคนที่เข้าใจ", 
        dimension: "F" // Feeling
      }
    ]
  },
];